cadastro/app/Controllers/AlunoController.php

INSERT INTO `alunos` (`nome`, `nascimento`, `endereco`, `cidade`) VALUES ('Andreia', '1978-01-16', 'Rua principal do arraial 321', 'Araçuai')
---
    public function index()
    {
        if ($this->request->getMethod() === 'post') {
            $alunoModel = new AlunoModel();
            $data = [
                'nome'      => $this->request->getPost('nome'),
                'nascimento' => $this->request->getPost('nascimento'),
                'endereco'  => $this->request->getPost('endereco'),
                'cidade'    => $this->request->getPost('cidade'),
            ];
            $alunoModel->insert($data);

SELECT *
FROM `alunos`
---
    public function consulta()
    {
        $alunoModel = new AlunoModel();
        $alunos = $alunoModel->findAll();