cadastro/app/Models/AlunoModel.php

    public function getAlunoById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '1'

    public function updateAluno($id, $data)
    {
        // Verifica se o aluno existe antes de tentar atualizar
        if ($this->getAlunoById($id)) {
            $this->update($id, $data);
---
UPDATE `alunos` SET `nome` = 'Pedro Henrique ', `nascimento` = '1994-10-29', `endereco` = 'Rua das paineiras 545', `cidade` = 'Araçua'
WHERE `alunos`.`id` IN ('1')

    public function deleteAluno($id)
    {
        // Verifica se o aluno existe antes de tentar excluir
        if ($this->getAlunoById($id)) {
            $this->delete($id);
---
DELETE FROM `alunos`
WHERE `id` IN ('7')